// Задача 1. Вывести квадрат числа
Console.WriteLine("Введите число");
// Конвертируем строку в целое число
int numberValue = Convert.ToInt32(Console.ReadLine());
int resultValue = numberValue*numberValue;
Console.WriteLine(resultValue);